#pragma once
/**
*@brief ‘ункци€ создает новую строку, состо€щую из символов с четным индексом из первой строки (str1) и символов с нечетным индексом из второй строки (str2). 
*@param str1  ”казатель на первую строку.
*@param str2  ”казатель на вторую строку.
*@param newStr  ”казатель на массив символов, в который будет записана нова€ строка.
*@param length  ƒлина новой строки (должна быть не меньше, чем длина самой короткой строки).
 */
void createNewString(const char* str1, const char* str2, char* newStr, int length);
