#pragma once
/**
 * @brief Вычисляет функцию Эйлера для заданного числа.
 * @param n: Число, для которого нужно вычислить функцию Эйлера.
 * @return Значение функции Эйлера для заданного числа.
 */
unsigned int eulerFunction(unsigned int n);



/**
 * @brief Вычисляет степень числа.
 * @param base: Основание числа.
 * @param exponent: Показатель степени.
 * @return Результат возведения основания в степень.
 */
double power(double base, int exponent);
/**
 * @brief Вычисляет факториал заданного числа.
 * @param n: Число, для которого нужно вычислить факториал.
 * @return Факториал заданного числа.
 */
double factorial(int n);
/**
 * @brief Вычисляет значение ряда Тейлора для заданного числа и точности.
 * @param x: Число, для которого нужно вычислить ряд Тейлора.
 * @param precision: Количество членов, включаемых в ряд Тейлора.
 * @return Значение ряда Тейлора для заданного числа и точности.
 */
double taylorSeries(double x, int precision);

